<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of Zoom and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.teamlewis.filewave.ZoomIT</string>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.hansen-m.download.zoomus</string>
    <key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Zoom</string>
        <key>fw_app_bundle_id</key>
        <string>com.github.teamlewis.filewave.ZoomIT</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://zoom.us/client/latest/ZoomInstallerIT.pkg</string>
		<key>re_pattern</key>
                <string>href="/client/([^"]*)/ZoomInstallerIT.pkg" class="btn"</string>
                <key>re_flags</key>
                <array>
                <string>IGNORECASE</string>
                </array>
                <key>result_output_var_name</key>
                <string>version</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
                                <key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
                                <string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
