<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of Zoom and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.teamlewis.filewave.ZoomIT</string>
	<key>DOWNLOAD_URL</key>
	<string>https://zoom.us/client/latest/ZoomInstallerIT.pkg</string>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.teamlewis.download.ZoomIT</string>
    <key>Input</key>
	<dict>
	<key>NAME</key>
	<string>ZoomInstallerIT</string>
        <key>fw_app_bundle_id</key>
        <string>com.github.teamlewis.filewave.ZoomIT</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                   
                </array>
                <key>filename</key>
                <string>ZoomInstallerIT.pkg</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
               			<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
                		<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
