<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads the latest version of Notion, creates a fileset, and copies it into your FileWave Server.</string>
	<key>Identifier</key>
	<string>com.github.teamlewis.filewave.Notion</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Notion</string>
        <key>fw_destination_root</key>
        <string>/Applications/Notion.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.teamlewis.download.Notion</string>
	<key>Process</key>
	<array>
     <dict>
        <key>Arguments</key>
         <dict>
            <key>dmg_path</key>
            <string>%pathname%</string>
         </dict>
         <key>Processor</key>
         <string>AppDmgVersioner</string>
         </dict>
         <dict>
         <key>Arguments</key>
         <dict>
             <key>pkgdirs</key>
             <dict>
                 <key>Applications</key>
                 <string>0775</string>
             </dict>
             <key>pkgroot</key>
             <string>%RECIPE_CACHE_DIR%/%NAME%</string>
         </dict>
         <key>Processor</key>
             <string>PkgRootCreator</string>
         </dict>
         <dict>
             <key>Arguments</key>
             <dict>
                 <key>destination_path</key>
                 <string>%pkgroot%/Applications/%app_name%</string>
                 <key>source_path</key>
                 <string>%pathname%/%app_name%</string>
             </dict>
             <key>Processor</key>
                 <string>Copier</string>
             </dict>
             <dict>
              <key>Arguments</key>
              <dict>
				<key>fw_app_bundle_id</key>
				<string>notion.id</string>
				<key>fw_app_version</key>
				<string>%version%</string>
                <key>fw_fileset_group</key>
				<string>Autopkgr_feeds</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pkgroot%/Applications/%app_name%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
