<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created by InakyMartinez</string>
	<key>Description</key>
	<string>Downloads the latest version of Lucid, creates a fileset, and copies it into your FileWave Server.</string>
	<key>Identifier</key>
	<string>dev.teamlewis.com.filewave.Lucid</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Lucid</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>dev.teamlewis.com.download.Lucid</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>com.lucidlink</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>/Applications/Lucid.app</string>
				<key>fw_fileset_group</key>
				<string>00 Autopkgr_feeds</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/downloads/Lucid.pkg</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
